ninety-nine-cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE (2) LIMIT $1  [["LIMIT", 1]]
---
    def index
        @cats = Cat.all